const msOrderListIndo = {

    //订单列表页-表格-表头
    orderListTitle: [
        '操作',//操作
        '电话号码', //电话号码
        '订单号',//订单号
        '创建时间',//创建时间
        '借款金额',//借款金额
        '借款天数',//借款天数
        '利率',//利率
        '计息方式',//计息方式
        '订单状态',//订单状态
    ],

    //表格数据
    orderTableData: {
        0: '查看', //查看
        1: '先息后本',//先息后本
        2: '暂无数据',//'暂无数据'
        3: '暂无筛选数据',//'暂无筛选数据'
    },

    //订单列表页  --搜索条件
    orderSearchItem: {
        0: '订单状态', //订单状态
        1: '查询字段',//查询字段
        2: '查询内容', //查询内容
        3: '创建时间', //创建时间
        4: '查询', //查询
        5: '空', //空
        6: '业务类型',//业务类型
    },

    //查询条件不足的提示信息
    searchPromptInfo:{
        searchError: '订单状态和查询字段不能同事为空！',//订单状态和查询字段不能同事为空
        contentError: '查询内容不能为空！',//查询内容不能为空
        fieldError: '请选择查询字段！',//请选择查询字段
    },
    //业务类型
    businessType:[
        {
            key: 'VCC-申请', //VCC-申请
            value: '1'
        }, {
            key: 'VCC-提现', //VCC-提现
            value: '2'
        }, {
            key: '员工贷', //员工贷s
            value: '3'
        },{
            key: '现金贷', //现金贷产品
            value: '4'
        },
    ],

    //订单列表页-订单状态全部
    searchTypeAll: [
        {
            key: '空',
            value: '-1'
        }, {
            key: '初始', //初始
            value: '0'
        }, {
            key: '系统通过',//系统通过
            value: '1'
        }, {
            key: '系统拒绝',//系统拒绝
            value: '2'
        }, 
        {
            key: '初审通过',//初审通过
            value: '3'
        }, {
            key: '初审拒绝',//初审拒绝
            value: '4'
        }, {
            key: '终审通过',//终审通过
            value: '5'
        }, {
            key: '终审拒绝',//终审拒绝
            value: '6'
        }, {
            key: '放款失败',//放款失败
            value: '7'
        }, {
            key: '放款成功',//放款成功
            value: '8'
        }
    ],
    //订单列表页-订单状态VCC体现
    searchTypeTX: [
        {
            key: '放款失败',//放款失败
            value: '7'
        }, {
            key: '放款成功',//放款成功
            value: '8'
        }, 
        {
            key: '提现拒绝',//提现拒绝
            value: '9'
        }
    ],
    //订单列表页-订单状态vcc申请
    searchTypeApply: [
        {
            key: '空',
            value: '-1'
        }, {
            key: '初始', //初始
            value: '0'
        }, {
            key: '系统通过',//系统通过
            value: '1'
        }, {
            key: '系统拒绝',//系统拒绝
            value: '2'
        }, 
        {
            key: '初审通过',//初审通过
            value: '3'
        }, {
            key: '初审拒绝',//初审拒绝
            value: '4'
        }, {
            key: '终审通过',//终审通过
            value: '5'
        }, {
            key: '终审拒绝',//终审拒绝
            value: '6'
        }
    ],
    //查询字段内容
    searchField: {
        kong:{
            key: '空',
            value: '-1'
        },
        auditField: [
            {
                key: '审核人员',//审核人员
                value: 'auditorName'
            },
            {
                key: '电话号码',//电话号码
                value: 'phoneNo'
            }, {
                key: '订单号',//订单号
                value: 'sourceId'
            }
        ],
        // orderField: [
        //     {
        //         key: 'Nomor Telepon',//电话号码
        //         value: 'phoneNo'
        //     }, {
        //         key: 'Nomor Pesanan',//订单号
        //         value: 'sourceId'
        //     }
        // ]
    },

    //订单列表-列表中的订单状态(VCC申请)
    orderStatusVCCAPPLY: {
        0: '未申请订单',//未申请订单
        1: '申请成功',//申请成功
        2: '审核中',//审核中
        3: '审核拒绝',//审核拒绝
        4: '审核通过',//审核通过
        6: '提现拒绝',//提现拒绝
    },

    //订单列表-列表中的订单状态(VCC提现)
    orderStatusVCCTX: {
        0: '未申请订单',//未申请订单
        1: '申请成功',//申请成功
        2: '放款失败',//放款失败
        3: '放款成功',//放款成功
        4: '订单结清',//订单结清
        6: '提现拒绝',//提现拒绝
    },

    //订单列表-列表中的订单状态(员工贷)
    orderStatusYGD: {
        0: '未申请订单',//未申请订单
        1: '申请成功',//申请成功
        2: '审核中',//审核中
        3: '审核拒绝',//审核拒绝
        4: '审核通过',//审核通过
        5: '放款失败',//放款失败
        6: '放款成功',//放款成功
        7: '贷款结清',//贷款结清
    }
}

export default msOrderListIndo
