
const msDetailListIndo = {
    //提示文案
    promptText:{
        text1: '用户贷款的总次数',//用户贷款的总次数
        text2: '用户上笔贷款的逾期天数',//用户上笔贷款的逾期天数
        text3: '上笔贷款是否是放款失败',//上笔贷款是否是放款失败
        text4: '上笔贷款是否是放款失败',//上笔贷款是否是放款失败
    },
    //命中规则
    hitRiskText: {
        hitRisk: '命中规则',//命中规则
        beforeReview: '审核前，请仔细阅读风险提示的内容!!',//审核前，请仔细阅读风险提示的内容!!
        isBind: '该身份证已被使用，只能选择拒绝操作！！！'//该身份证已被使用，只能选择拒绝操作！！！
    },
    //订单列表-详情页
    detailCardData: [
        {
            label: '订单信息', //订单信息
            tab: true
        }, {
            label: '用户信息', //用户信息
            tab: true
        }, 
    ],
    //历史借贷
    historyLoanTitle: {
        0: '',//查看
        1: '订单号',//订单号
        2: '创建时间',//创建时间
        3: '审核结果',//审核结果
        4: '结清时间',//结清时间
        5: '还款次数',//还款次数
        6: '逾期天数',//逾期天数
    },
    //借款信息-标题
    orderTitle: {
        orderInfo :'订单信息', //订单信息
        bankInfo :'放款银行信息', //放款银行信息
        userInfo :'用户信息', //用户信息
        baseInfo: '基本信息',//基本信息
        workInfo: '工作信息',//工作信息
        photo: '认证照片',//认证照片
        emergencyPerson: '紧急联系人',//紧急联系人
    },

    //借款信息-订单信息
    userOrderInfo: [
        {
            label: '贷款状态',//贷款状态
            key: 'orderStatus',
            value: '',//值
        }, {
            label: '借款金额',//借款金额
            key: 'principal',
            value: '',//值
        }, {
            label: '借款天数',//借款天数
            key: 'item',
            value: '',//值
        },
        {
            label: '砍头费',//砍头费
            key: 'beheadAmount', //
            value: '',//值
        }, 
        {
            label: '申请时间',//申请时间
            key: 'applyTime',
            value: '',//值
         }
    ],
    //借款信息-订单信息（vcc）
    userOrderInfoVCC: [
        {
            label: '贷款状态',//贷款状态
            key: 'orderStatus',
            value: '',//值
        },
        {
            label: '申请时间',//申请时间
            key: 'applyTime',
            value: '',//值
         }
    ],

    //借款信息-放款银行信息
    userBankInfo: [
        // {
        //     label: 'Nomor Identitas',//身份证号
        //     key: 'idCardNo',
        //     value: '',//值
        // }, {
        //     label: 'Advance Ai Hasil',//风控校验账户姓名
        //     key: 'verifyUserName',
        //     value: '',//值
        // }, 
        {
            label: '银行名称',//银行名称
            key: 'bankName', //
            value: '',//值
        }, {
            label: '银行账号',//银行账号
            key: 'bankAccount',
            value: '',//值
        }, 
        {
            label: '持卡人姓名',//持卡人姓名
            key: 'holderName',
            value: '',//值
        },
        // {
        //     label: 'Pengecekan Nama',//姓名规则校验
        //     key: 'authStatus',
        //     value: '',//值
        // }, {
        //     label: 'Saluran pembayaran',//支付渠道
        //     key: 'fundingName',
        //     value: '',//值
        // }
    ],

    //银行账户姓名与申请人姓名校验 
    bankInfoMatch:{
        title: '银行帐户名称和申请人姓名的验证',//银行帐户名称和申请人姓名的验证
        holderName: '银行账户名称',
        applyName: '申请人姓名',
        matchScore: '比对分数'
    },

    //订单信息-还款银行账号信息
    userPayInfo: [
        {
            label: '银行付款码',//银行付款码
            value: ''
        }, {
            label: '银行名称',//银行名称
            value: ''
        }
    ],

    //后端返回的订单详情的国际化
    //订单信息-贷款状态
    loanTypeText: {
        0: '未申请订单',//未申请订单
        1: '申请成功',//申请成功
        2: '审核中',//审核中
        3: '审核拒绝',//审核拒绝
        4: '审核通过',//审核通过
        5: '放款失败',//放款失败
        6: '放款成功',//放款成功
        7: '贷款结清',//贷款结清
    },

    //订单详情-借款天数
    loanDay: '天',//借款天数
    loanPeriode: '期',//期

    //订单详情-利率
    rate: '利率',

    //订单详情-计息方式
    rateTypeText: {
        0: '计息方式'
    },

    //放款银行账号-姓名规则校验
    nameValid: {
        0:'未校验',//未校验
        1: '校验中',//校验中
        2: '一致',//一致
        3: '不一致'//不一致
    },

    //还款银行账号信息-为找到记录
    nonePay: '找不到记录',

    //用户信息-四个标题-后端返回数据的文案
    userTitle: {
        //标题
        userInfo: '用户信息',//用户信息
        photo: '认证照片',//认证照片
        callBook: '本地通讯录',//本地通讯录
        emergencyPerson: '紧急联系人',//紧急联系人
        message: '本地短信',//本地短信
        callRecord: '通话记录',//通话记录
        historyLoan: '历史借贷',//历史借贷
        //认证照片
        lastPhoto: '上次图片',//上次图片
        recentPhoto: '本次照片',//本次照片
        //button
        phone: '手机号',//手机号
        count: '联系次数',//联系次数
        sendOrAcceptTime: '收发时间',//收发时间
        riskMessage: '风险短信',//风险短信
        callTime: '通话时间',//通话时间
        callDuration: '通话时长',//通话时长
        //短信列表返回的数据的文案
        haveRead: '已读',//已读
        unread: '未读',//未读
        receive: '接收',//接收
        send: '发送',//发送
        isRisk: '是',//是
        noRisk: '否',//否
        //时分秒、通话类型、通话状态
        h: '小时',//小时
        m: '分钟',//分钟
        s: '秒',//秒
        out:'呼出',//呼出
        in:'呼入',//呼入
        reject: '拒接',//拒接
        no: '未接通',//未接通
        yes: '接通',//接通
        noNumber: '空号',//空号
        selfAnswer: '本人接听',//本人接听
        unknown: '未知',//未知
        powerOff: '关机',//关机
        //submit
        action: '操作',//操作
        rejectReason: '拒绝原因',//拒绝原因
        remark: '备注',//备注
        submit: '提交',//提交
        //通过、拒绝操作弹框
        title:'是否提交审核操作？',//是否提交审核操作
        auditWarning: '提交审核失败,该工单已被释放!',//提交审核失败,该工单已被释放
        confirm: '确认',//确认
        cancel: '取消',//取消
        goBack: '返回订单列表页',//返回订单列表页
        goTop: '返回顶部',//返回顶部
        loading: '审核中',//审核中
        //历史借贷
        createTime: '创建时间',//创建时间
        opera: '查看',//查看
        noCaseTip: '注册用户未进件',//注册用户未进件
    },

    //历史借贷表头
    historyLoanColumnTitle:[
        '业务类型',//业务类型
        '订单号',//订单号
        '创建时间',//创建时间
        '订单状态',//订单状态
        '结清时间',//结清时间
        '逾期天数',//逾期天数
        '拒绝原因',//拒绝原因
    ],
    businessType:{
        1: 'VCC-申请', //VCC-申请
        2: 'VCC-提现', //VCC-提现
        3: '员工贷', //员工贷s   
        4: '现金贷', //现金贷产品
    },

    //用户基本信息
    userBaseInfo: [
        {
            label: '电话号码',//电话号码
            key: 'userPhoneNo',
            value: '',//值
        }, {
            label: '真实姓名',//真实姓名
            key: 'name',
            value: '',//值
            canEdit: true,
        }, {
            label: '母亲姓名',//母亲姓名
            key: 'motherName',
            value: '',//值
        }, {
            label: '身份证号',//身份证号
            key: 'idCardNo',
            value: '',//值
            canEdit: true,
        },{
            label: '性别',//性别
            key: 'gender',
            value: '',//值
        }, {
            label: '年龄',//年龄
            key: 'age',
            value: '',//值
        },  {
            label: '学历',//学历
            key: 'education',
            value: '',//值
        }, {
            label: '婚姻状况',//婚姻状况
            key: 'maritalStatus',
            value: '',//值
        },  {
            label: '借款目的',//借款目的
            key: 'purpose',
            value: '',//值
        }, {
            label: '邮箱',//邮箱
            key: 'email',
            value: '',//值
            canEdit: true,
        },  {
            label: '详细地址',//详细地址
            key: 'detailAddress',
            value: '',//值
        }, 
    ],
    //用户工作信息
    userWorkInfo: [
        {
            label: '职业',//职业
            key: 'occupation',
            value: '',//值
        }, {
            label: '工作年限',//工作年限
            key: 'workTime',
            value: '',//值
        },{
            label: '月薪',//月薪
            key: 'income',
            value: '',//值
        }, {
            label: '发薪日',//发薪日
            key: 'payDay',
            value: '',//值
        }, {
            label: '公司名称',//公司名称
            key: 'companyName',
            value: '',//值
        }, {
            label: '公司电话',//公司电话
            key: 'companyPhoneNo',
            value: '',//值
        }, {
            label: '公司地址',//公司地址
            key: 'companyAddress',
            value: '',//值
        },
    ],

    //婚姻状况
    maritalStatus: {
        1: '单身',//单身
        2: '已婚',//已婚
        3: '离异',//离异
        4: '丧偶',//丧偶
    },
    //月薪
    incomeList:{
        1: '0-2 Juta',
        2: '2-4 Juta',
        3: '4-6 Juta',
        4: '6-8 Juta',
        5: '8-10 Juta',
        6: 'Lebih dari 10 Juta',
    },

    //用户信息-联系人信息
    contactText: [
        {
            label: '联系人姓名#1',//联系人姓名#1
            value: '',//值
        }, {
            label: '联系人姓名#2',//联系人姓名#2
            value: '',//值
        }, {
            label: '联系人关系#1',//联系人关系#1
            value: '',//值
        }, {
            label: '联系人关系#2',//联系人关系#2
            value: '',//值
        }, {
            label: '联系人电话#1',//联系人电话#1
            value: '',//值
        }, {
            label: '联系人电话#2',//联系人电话#2
            value: '',//值
        }, {
            label: '联系次数#1',//联系次数#1
            value: '',//值
        }, {
            label: '联系次数#2',//联系次数#2
            value: '',//值
        }
    ],

    //用户信息-table无数据的展示
    tableNoText: '没有数据',

    //用户信息-认证照片
    userPhotoTitle: {
        0: '正面照片',//正面照片
        1: '手持照片',//手持照片
        2: '人脸比对照片',//人脸比对照片
        3: '税卡照片',//税卡照片
        4: '其他照片',//其他照片

        5: '身份证反面',//身份证反面
        6: '户口本',//户口本
        7: '社保卡',//社保卡
        8: '工作照',//工作照
        9: '工资单',//工资单
    },
    //用户信息-紧急联系人-表头
    userEmergencyContactsTitle: {
        0: '姓名',//姓名
        //1: 'Gender',//性别
        1: '关系',//关系
        2: '手机号',//手机号
        3: '是否平台用户',//是否平台用户
        //4: '联系情况',//联系情况
        4: '平台用户',//平台用户
    },
    //用户信息-本地通讯录-表头
    userCallBookTitle: {
        0: '姓名',//姓名
        1: '手机号',//手机号
        2: '联系次数'//联系次数
    },
    //用户信息-本地短信-表头-已读-短信类型
    userMessageTitle: {
        0: '姓名',//姓名
        1: '收发时间',//收发时间
        2: '手机号',//手机号
        3: '风险短信',//风险短信
        4: '已读',//已读
        5: '短信类型',//短信类型
        6: '短信内容',//短信内容
    },

    //用户信息-本地通话记录-表头
    userCallRecordTitle: {
        0: '通话时间',//通话时间
        1: '姓名',//姓名
        2: '手机号',//手机号
        3: '通话时长',//通话时长
        4: '通话类型',//通话类型
        5: '通话状态',//通话状态
    },

    //用户信息-后端返回数据的对应text
    /**
     * genderText: 性别 professionText: 职业 educationText:学历  relationText: 关系 purposeText: 借款目的
     */
    genderText: {
        0: '女',//女
        1: '男',//男
    },
    occupationText: {
        1: '私人雇员',//私人雇员
        2: '公务员',//公务员
        3: '医生',//医生
        4: '承包人',//承包人
        5: '民事',//民事
        6: '学生 ',//学生
        7: '律师',//律师
        8: '其他'//其他
    },
    educationText: {
        1: '小学',//小学
        2: '初中' ,//初中
        3: '高中' ,//高中
        4: '大专',//大专
        5: '大学',//大学
        6: '硕士',//硕士
        7: '博士',//博士
    },
    relationText: {
        1: '父母',//父母
        2: '配偶' ,//配偶
        3: '孩子' ,//孩子
        4: '亲戚',//亲戚
        5: '朋友',//朋友
        6: '同事',//同事
        7: '合作伙伴',//合作伙伴
    },
    purposeText: {
        1: '健康医疗',//健康医疗
        2: '兼职创业' ,//兼职创业
        3: '数码产品',//数码产品
        4: '教育培训',//教育培训
        5: '旅行消费',//旅行消费
        6: '家居／装修',//家居／装修
        7: '租房',//租房
    },

    //审核信息表头
    auditInfoTitle: {
        0: '审核时间',//审核时间
        1: '阶段',//阶段
        2: '审核结果',//审核结果
        3: '审核人员姓名',//审核人员姓名
        4: '审核意见'//审核意见
    },
    //后台返回是审核信息
    auditLevelText: {
        '0': '未审核',//未审核
        '1': '机审',//机审
        '2': '初审',//初审
        '3': '终审',//终审
    },
    auditActionText: {
        '0': '初始化',//初始化
        '1': '机审通过',//机审通过
        '2': '机审拒绝',//机审拒绝
        '3': '初审通过',//初审通过
        '4': '初审拒绝',//初审拒绝
        '5': '终审通过',//终审通过
        '6': '终审拒绝'//终审拒绝
    },


    //最后的提交表单
    auditForm: {
        status: '2',
        rejectReason: '身份证号码不一致',
        remark: ''
    },

    //拒绝原因
    rejectReason: {
        1: '身份证信息不一致', //身份证信息不一致
        2: '工作信息不一致', //工作信息不一致
        3: '通话记录异常', //通话记录异常
        4: '提交虚假信息', //提交虚假信息
        5: '手持身份证与借款人不一致', //手持身份证与借款人不一致
        6: '电话号码异常', //电话号码异常
        7: '银行卡信息与本人不一致', //银行卡信息与本人不一致
        8: '还款能力不足', //还款能力不足
        9: '历史还款逾期', //历史还款逾期
        10: '多头借贷', //多头借贷
        11: '难以联系', //难以联系
        12: '负面信息', //负面信息
        13: '照片有误', //照片有误
        14: '紧急联系人异常', //紧急联系人异常
        15: '黑名单', //黑名单
        16: '其他', //其他
    },

    actionText: [
        {
            key: '1',
            value: '通过'
        }, {
            key: '2',
            value: '拒绝'
        },
    ],

    tabCS: {
        loanInfo: '贷款信息',//贷款信息
        creditReport: '信用报告',//信用报告
        gender: '性别',//性别
        age: '年龄',//年龄
        isJabLiver: '是Jabodetabek居民？',//是Jabodetabek居民？
        isJobSuitable: '借款人职业是否合适？',//借款人职业是否合适？
        workAge: '工作多久了',//工作多久了
        isSalarySuitable: '借款人的工资合适吗',//借款人的工资合适吗

        nameIDSame: '名字是否与身份证符合',//名字是否与身份证符合
        addressIDSame: '借款人的住所是否与身份证相同?',//借款人的住所是否与身份证相同
        hasTaxCard: '借款人是否附加NPWP（税卡）',//借款人是否附加NPWP（税卡）
        taxCardBelongBorrower: 'NPWP是否属于借款人',//NPWP是否属于借款人
        hasWorkProve: '借款人是否附上工作证明？',//借款人是否附上工作证明？
        workProveBelongBorrower: '工作证明是否是借款人的证明',//工作证明是否是借款人的证明
        hasOtherProve: '借款人是否附上其他证明文件？',//借款人是否附上其他证明文件？
        
        phoneRight: '手机号码是否正确',//手机号码是否正确
        phoneCanBeCall: '是否可以联系借款人的手机号码?',//是否可以联系借款人的手机号码？
        hasCreditCard: '是否有信用卡',//是否有信用卡
        loanCount: '3个月内贷款软件数量',//3个月内贷款软件数量
        loanAmountOtherApp: '三个月其他内贷款软件金额',//三个月其他内贷款软件金额
        overDueDay: '12个月内逾期天数',//12个月内逾期天数
        canContactEm: '是否可以联系紧急联系人?',//是否可以联系紧急联系人?
        whichEmCanbeProve: '哪些紧急联系人愿意成为借款人的见证人? ',//哪些紧急联系人愿意成为借款人的见证人？
    } ,
    tabResult:{
        scoreTitle: '得分结果',//得分结果
        score: '得分',//得分
        suggest: '最终建议',//最终建议
        finalResult: '最终结果',//最终结果
        finalReview: '最终审核',//最终审核
        remark: '审批备注',//审批备注
        pass: '通过',//通过
        reject: '拒绝',//拒绝
        waitPersonReview: '人工介入复查',//人工介入复查
        detailReport: '详细报告',//详细报告
    },
    faceIdentification:{
        title: '人脸匹配',//人脸匹配
        similarity: '相似度',//相似度
        compareCount: '对比次数',//对比次数
        countTip: '该用户校验超过10次，建议拒绝',//该用户校验超过10次，建议拒绝
        reviewSuggestion: '审核建议',//审核建议
    },
    rejectModal:{
        rejectType: '拒绝类型(必填)',//拒绝类型
        rejectReason: '拒绝原因(必填)',//拒绝原因
        rejectTypeForTabTwo: '拒绝类型',//拒绝类型
        rejectReasonForTabTwo: '拒绝原因',//拒绝原因
        title: '审核操作',
        label: '审批备注(必填)',
        commit: '确定',
        errorTip: '请填写审批备注！',
        operationTip: '*拒绝类型、拒绝原因、审批备注当审批结果为拒绝时必填'
    },
    rejectType: {//拒绝类型
        1: 'D1非目标人群',//D1非目标人群
        2: 'D2资料不符合要求',//D2资料不符合要求
        3: 'D3欺诈',//D3欺诈
        4: 'D4信息不真实',//D4信息不真实
        5: 'D5调查异常',//D1非目标人群
        6: 'D6负面信息',//D1非目标人群
    },
    rejectDetailReason: {//拒绝原因详细
        1:{
            11: '无收入或收入不符合要求',//无收入或收入不符合要求
            12: '无能力偿还',//无能力偿还
            13: '禁入类人群',//禁入类人群
            14: '借款用途不符',//借款用途不符
            15: '非印尼当地居民',//非印尼当地居民
            16: '实际年龄不符合要求',//实际年龄不符合要求
            17: '借款人为我司员工',//借款人为我司员工
        },
        2:{
            21: '未提供身份证',//未提供身份证
            22: '未提供税卡',//未提供税卡
            23: '未显示活体照片',//未显示活体照片
            24: '身份证不清晰或已损坏',//身份证不清晰或已损坏
            25: '税卡不清晰或已损坏',//税卡不清晰或已损坏
            26: '所提供资料非原件',//实际年龄不符合要求
        },
        3:{
            31: '虚假身份证',//虚假身份证
            32: '虚假税卡',//虚假税卡
            33: '非本人申请',//非本人申请
            34: '提交资料与系统填写信息不一致',//提交资料与系统填写信息不一致
            35: '活体照片非本人拍摄',//活体照片非本人拍摄
            36: '其他原因',//其他原因
        },
        4:{
            41: '预留联系人为客户本人电话',//预留联系人为客户本人电话
            42: '预留联系人不认识客户',//预留联系人不认识客户
            43: '客户单位信息不真实',//客户单位信息不真实
            44: '住宅信息不真实',//住宅信息不真实
            45: '核实信息不符合逻辑',//核实信息不符合逻辑
            46: '联系人信息不真实',//联系人信息不真实
            47: '其他原因',//其他原因
        },
        5:{
            51: '无法联系到客户',//无法联系到客户
            52: '客户手机关机、空号',//客户手机关机、空号
            53: '紧急联系人关机或无人接听',//紧急联系人关机或无人接听
            54: '客户要求放弃借款',//客户要求放弃借款
            55: '紧急联系人空号',//紧急联系人空号
        },
        6:{
            61: '通过调查了解到客户有高负债',//通过调查了解到客户有高负债
            62: '通过调查了解到客户有不良嗜好',//通过调查了解到客户有不良嗜好
            63: '通过调查了解到客户意思同行业或同行业推荐办理',//通过调查了解到客户意思同行业或同行业推荐办理
            64: '通过调查了解到客户同行有逾期',//通过调查了解到客户同行有逾期
            65: '三方应用及网站显示客户有负面信息',//三方应用及网站显示客户有负面信息
        },
    },
    //用户信息编辑对话框
    userInfoEditModal:{
        title: '编辑',
        firstName: '姓',
        lastName: '名',
        value: '值',
        commit: '确认'
    }
}

export default msDetailListIndo
